# RemoveSpare Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..RemoveSpare Method
PanelScheduleView Class See Also
---
Remove a spare at specific cell.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void RemoveSpare(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Sub RemoveSpare ( _
	nRow As Integer, _
	nCol As Integer _
)
```

Visual C++
---
```text
public:
void RemoveSpare(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number
nCol
    Type: System..::..Int32 Column Number
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | The row column combination does not represent a valid spare. |

# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace